TRUNCATE TABLE
item_order,
orders,
items,
models,
customers,
stores,
brands,
item_types,
item_categories
RESTART IDENTITY CASCADE;

INSERT INTO item_categories(title, description) VALUES
('Електроніка', 'Електронні пристрої та аксесуари'),
('Побутова техніка', 'Техніка для дому'),
('Комп''ютери та комплектуючі', 'Комп''ютери, ноутбуки та комплектуючі'),
('Спортивні товари', 'Товари для спорту та активного відпочинку'),
('Сантехніка', 'Обладнання для ванної кімнати та кухні'),
('Ігрові товари', 'Консолі, ігри та аксесуари');

INSERT INTO item_types(title, description) VALUES
('Смартфон', 'Мобільний телефон'),
('Ноутбук',	'Портативний комп''ютер'),
('Монітор',	'Пристрій виводу зображення'),
('Пральна машина', 'Побутова техніка для прання'),
('Велосипед', 'Двоколісний транспорт'),
('Ігрова консоль', 'Пристрій для запуску відеоігор');


INSERT INTO brands(title, description) VALUES 
('Apple', 'Американський бренд електроніки'),
('Samsung', 'Південнокорейський бренд'),
('Lenovo', 'Китайський бренд'),
('Bosch', 'Німецький бренд побутової техніки'),
('Trek', 'Виробник велосипедів'),
('Sony', 'Японський виробник електроніки');

INSERT INTO stores(title, description) VALUES
('Київ', 'Центральний склад'),
('Львів', 'Західний склад'),
('Одеса', 'Південний склад'),
('Дніпро', 'Центрально-східний склад'),
('Харків', 'Східний склад'),
('Вінниця', 'Регіональний склад');

INSERT INTO customers(name, email) VALUES
('Іван Петренко', 'ivan@gmail.com'),
('Олена Коваль', 'olena@gmail.com'),
('Максим Шевченко', 'maksym@gmail.com'),
('Анна Іваненко', 'anna@gmail.com'),
('Дмитро Сидоренко', 'dmytro@gmail.com'),
('Марія Бондар', 'maria@gmail.com');

INSERT INTO models(title, brand_id, description) VALUES
('iPhone 16', 1, 'Флагманський смартфон Apple'),
('Galaxy S25', 2, 'Флагманський смартфон Samsung'),
('ThinkPad X1', 3, 'Бізнес-ноутбук Lenovo'),
('Serie 8', 4, 'Пральна машина Bosch'),
('Marlin 8', 5, 'Гірський велосипед Trek'),
('PlayStation 5 Slim', 6, 'Ігрова консоль Sony'),
('Lenovo Legion 5', 3, 'Ігровий ноутбук Lenovo'),
('Bosch KGN39', 4, 'Холодильник Bosch');

INSERT INTO items(categ_id, type_id, brand_id, model_id, store_id, price, amount) VALUES
(1,	1, 1, 1, 1, 49999.99, 15),
(1, 1, 2, 2, 2, 42999.99, 20),
(3, 2, 3, 3, 3, 68999.99, 8),
(2, 4, 4, 4, 4, 25999.99, 12),
(4, 5, 5, 5, 5, 31999.99, 6),
(6, 6, 6, 6,6, 24999.99, 10),
(3, 2, 3, 7, 5, 31999.99, 25);

INSERT INTO orders(code, date, amount, paid, customer_id) VALUES 
('550e8400-e29b-41d4-a716-446655440000', '2026-09-01 10:00', 100000, true, 1),
('550e8400-e29b-41d4-a716-446655440001', '2026-09-02 14:30', 43000, false, 2),
('550e8400-e29b-41d4-a716-446655440002', '2026-09-03 09:15', 69000, true, 3),
('550e8400-e29b-41d4-a716-446655440003', '2026-09-04 18:20', 78000, true, 4),
('550e8400-e29b-41d4-a716-446655440004', '2026-09-05 12:40', 64000, false, 5),
('550e8400-e29b-41d4-a716-446655440005', '2026-09-06 11:10', 50000, true, 6),
('550e8400-e29b-41d4-a716-446655440006', '2026-09-06 14:45', 86000, true, 2);

INSERT INTO item_order VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6);

